Revit 2027 API
GlobalParameter.IsDrivenByFormula Property
 Indicates whether this parameter is driven by a formula or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsDrivenByFormula { get; }
Public ReadOnly Property IsDrivenByFormula As Boolean
	Get
public:
property bool IsDrivenByFormula {
	bool get ();
}
member IsDrivenByFormula : bool with get
Property Value
Boolean
Remarks
Note that the value of this property is always the opposite of the IsDrivenByDimension property. It is so because a parameter of which value is evaluated by a formula cannot be driven by a dimension, and vice versa.
See Also
Reference
GlobalParameter Class
Autodesk.Revit.DB Namespace